Repository: BaezCode/ChatGpt
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# helloWorld
source: Creates Images Through Natural Language Compression
es: Crea Imágenes Atrevés de la Compresión del Lenguaje Natural
pt: Crie imagens por meio da compreensão da Linguagem natural

# helloWorld2
source: Answer Queries and Doubts Through Artificial Intelligence
es: Responde Consultas y dudas A Través de la Inteligencia Artificial
pt: Responda a perguntas e dúvidas por meio de inteligência Artificial

# loginApple
source: Sign in with apple
es: Login con Apple
pt: Login com Apple

# error
source: Error or Account Deleted
es: Error o cuenta eliminada
pt: Erro ou conta Eliminada

# googla
source: Sign in with Google
es: Continuar con Google
pt: Continuar com Google

# welcome
source: Hello What can I do for you?
es: ¿Hola, qué puedo hacer por ti?
pt: Olá, o que eu posso fazer por você?

# header
source: Text Mode
es: Modo Texto
pt: Modo Texto

# header2
source: Image Mode
es: Modo Imagen
pt: Modo Imagen

# send
source: Send Message
es: Enviar Mensaje
pt: Enviar Mensagem

# consult
source: Examples
es: Ejemplos
pt: Exemplos

# consult2
source: What is Matter in Simple Terms
es: Que es Materia en Términos Simples
pt: O que é matéria em termos simples

# consult3
source: Can you recommend me a happy song?
es: Puedes Recomendarme una Canción Alegre?
pt: Pode me recomendar uma música feliz?

# consult4
source: Create a Red Lion
es: Un León de Color Rojo
pt: Um leão de cor vermelha

# consult5
source: Monkeys flying in space
es: Monos volando en el Espacio
pt: Macacos voando no Espaço

# modo1
source: Text Mode
es: Modo Consulta
pt: Modo Consulta

# modo2
source: Image Mode
es: Generador de Imagen
pt: Gerador de imagens

# info
source: Informations
es: Informaciones
pt: Informações

# tokensConfig
source: Set up tokens
es: Configurar Tokens
pt: Configurar Tokens

# imageInfo
source: Create realistic images and art from a Natural Language Description. Write what you think and the image will be created
es: Crea imágenes y Arte realistas a Partir de una Descripción en Lenguaje Natural Escribe lo que Piensas y la Imagen sera Creada
pt: Crie imagens realistas e arte a partir de uma descrição em linguagem natural Digite o que você pensa e a imagem será criada

source: Start
es: Comenzar
pt: Iniciar

source: Model
es: Modelo
pt: Modelo

# davinci
source: Can understand and Generate Natural Language Can ask complex questions for which it will give you a specific answer thanks to the powerful Davinci engine
es: Puede entender y Generar Lenguaje Natural Puedes hacer preguntas complejas por la cual le dará una respuesta concreta gracias al potente motor Davinci
pt: Você pode entender e gerar linguagem natural Você pode fazer perguntas complexas para as quais ele lhe dará uma resposta concreta graças ao poderoso mecanismo Davinci

# adTokens
source: ¿How Get Tokens?
es: ¿Como Adquirir Tokens?
pt: ¿Como Adquirir Tokens?

# tokenCer
source: You can Get tokens watching ads or by paying for different plans available in the application, this helps us to keep the application running.
es: Puedes adquirir Tokens gratuitamente viendo anuncios o de manera Paga de diferentes planos que tienes disponible en el aplicativo, esto nos ayuda a mantener el aplicativo en funcionamiento
pt: Você pode adquirir Tokens gratuitamente assistindo a anúncios ou pagando por diferentes planos que você tem disponíveis no aplicativo, isso nos ajuda a manter o aplicativo funcionando

# freeTokens
source: first installation of the system you have available 2.000 free tokens so you can ask your first questions or generate your first images, enjoy it.
es: Tokenes Gratuitos!
pt: Tokens Gratuitos!

# fredescrip
source: As a te Natural Language You can ask complex questions for which it will give you a concrete answer thanks to the powerful Davinci engine.
es: Como primera instalación del sistema tienes disponible 2.000 tókenes gratuitos para que puedas hacer sus primeras preguntas o genera sus primeras imágenes, Disfrútelo
pt: Como primeira instalação do sistema, você tem à disposição 2.000 fichas gratuitas para que você possa fazer suas primeiras perguntas ou gerar suas primeiras imagens.

source: Limit Tokens
es: Limitar Tokens
pt: Limitar Tokens

# limitTokensDescripc
source: Here you can set the Maximum Limit of Tokens per Response that can be used in each Response.
es: Aqui puedes Establecer el Limite Maximo de uso Tokens por respuesta que pueden ser Utilizados en cada Respuesta
pt: Aqui você pode definir os tokens de limite de uso máximo por resposta que podem ser usados ​​em cada resposta

# finalDescrip
source: The model moves through tokens whereby 1 token is equivalent to 5 characters of response written by the Robot, the more tokens configured, the more complex and detailed the response given by the model, the less tokens configured, the shorter the response will be.
es: El modelo se mueve a través de Tokens por la cual 1 Token equivalen a 5 Caracteres de respuesta Escrita por el Robot, cuando más tokens tenga configurado, más compleja y detallada será la respuesta dada por el modelo ,cuanto menos tokens tenga configurado más corta será la respuesta
pt: O modelo funciona por Tokens onde 1 Token equivale a 5 Caracteres de Resposta Escrito pelo Robô, quanto mais tokens tiver configurado, mais complexa e detalhada será a resposta dada pelo modelo, quanto menos tokens tiver configurado, mais curto será será em resposta

# tokenLimit
source: Token Usage Limits
es: Limite de uso de Tokens
pt: Limite de uso de Tokens

# tokenLimitDescrp
source: Here you can set the Maximum Limit of Tokens per Response that can be used in each Response.
es: Aqui puedes Establecer el Limite Maximo de uso Tokens por respuesta que pueden ser Utilizados en cada Respuesta
pt: Aqui você pode definir os tokens de limite de uso máximo por resposta que podem ser usados ​​em cada resposta

# tokenLimitDescrp2
source: The model moves through tokens whereby 1 token is equivalent to 5 characters of response written by the Robot, the more tokens configured, the more complex and detailed the response given by the model, the less tokens configured, the shorter the response will be.
es: El modelo se mueve a través de Tokens por la cual 1 Token equivalen a 5 Caracteres de respuesta Escrita por el Robot, cuando más tokens tenga configurado, más compleja y detallada será la respuesta dada por el modelo ,cuanto menos tokens tenga configurado más corta será la respuesta
pt: O modelo funciona por Tokens onde 1 Token equivale a 5 Caracteres de Resposta Escrito pelo Robô, quanto mais tokens tiver configurado, mais complexa e detalhada será a resposta dada pelo modelo, quanto menos tokens tiver configurado, mais curto será será em resposta

source: Confirm
es: Confirmar
pt: Confirmar

# logout1
source: Log out
es: Cerrar sesión
pt: Sair

# logout2
source: Are you sure you want to log out?
es: ¿Estás seguro de que quieres Cerrar sesión?
pt: ¿Tem certeza que deseja Sair??

# premium1
source: Available:
es: Tienes Disponible:
pt: Você tem disponível

# premium2
source: Get Full Access
es: Obtener Acceso completo
pt: Obtenha acesso total

# premium3
source: With the purchase you help to keep the App Live.
es: Con la Compra Ayudas a mantener la App Activa
pt: Com a compra você ajuda a manter o App Ativo

# pay1
source: Payment Confirmed!
es: Pago Confirmado!
pt: Pagamento Confirmado!

# pay2
source: Tokens Purchased
es: Tokens Comprados
pt: Tokens Comprados

# tipping
source: Writing
es: Escribiendo
pt: Escrevendo

# tippingImage
source: Creating Image
es: Generando Imagen
pt: Gerando Imagem

# confirmar2
source: CONFIRM
es: CONFIRMAR
pt: CONFIRMAR

# delete1
source: Delete Account
es: Eliminar Cuenta
pt: Eliminar conta

# delete2
source: Are you sure you want to delete your account? Please read how account deletion will affect
es: ¿Está seguro de que desea eliminar su cuenta? Lea cómo afectará la eliminación de la cuenta
pt: ¿Tem certeza de que deseja excluir sua conta? Leia como a exclusão da conta afetará

# delete3
source: Account
es: Cuenta
pt: Conta

# delete4
source: Deleting your account removes personal information from our database, Your email becomes permanently reserved and same email cannot be re-used to register a new account
es: Eliminar su cuenta elimina la información personal de nuestra base de datos. Su correo electrónico se reserva de forma permanente y el mismo correo electrónico no se puede reutilizar para registrar una nueva cuenta.
pt: Excluir sua conta remove informações pessoais de nosso banco de dados. Seu e-mail é permanentemente reservado e o mesmo e-mail não pode ser reutilizado para registrar uma nova conta.

# delete5
source: Deleting your account all you Tokens will be lost
es: Al eliminar su cuenta, todos sus tokens se perderán
pt: Ao excluir sua conta, todos os seus tokens serão perdidos

# delete6
source: Confirm Account Deletion
es: Confirmar eliminación de cuenta
pt: Confirmar exclusão da conta

# rewward
source: Reward Earned
es: Recompensa Obtenida
pt: Recompensa Adquirida

# variation
source: Create Variation
es: Crear Variación
pt: Criar variação

# variationWait
source: Generating Variation
es: Generando variación
pt: Gerando Variação

# dear1
source: Dear User
es: Querido usuario
pt: Querido Usuário

# dear2
source: We care about your privacy and data security. We keep this app free by showing ads.
es: Nos preocupamos por su privacidad y la seguridad de sus datos. Mantenemos esta aplicación gratuita al mostrar anuncios.
pt: Nós nos preocupamos com sua privacidade e segurança de dados. Mantemos este aplicativo gratuito exibindo anúncios.

# dear3
source: Can we continue to use your data to tailor ads for you?
es: ¿Podemos seguir usando sus datos para personalizar los anuncios para usted?
pt: Podemos continuar a usar seus dados para personalizar anúncios para você?

# dear4
source: You can change your choice anytime in the app settings.
es: Puede cambiar su elección en cualquier momento en la configuración de la aplicación.
pt: Você pode alterar sua escolha a qualquer momento nas configurações do aplicativo.

# dear5
source: Our partners will collect data and use a unique identifier on your device to show you ads.
es: Nuestros socios recopilarán datos y utilizarán un identificador único en su dispositivo para mostrarle anuncios.
pt: Nossos parceiros coletarão dados e usarão um identificador exclusivo em seu dispositivo para exibir anúncios.

# pr1
source: Unlimited answers
es: Respuestas ilimitadas
pt: Respostas ilimitadas

# pr2
source: No Ads
es: Sin Anuncios
pt: Sem anúncios

# pr4
source: Unlimited Images
es: Imágenes Ilimitadas
pt: Imagens Ilimitadas

# pr5
source: Faster Queries
es: Consultas mas Rapidas
pt: Consultas mais rápidas

# pro
source: Pro Version
es: Versión Pro
pt: Versão Pro

# mensual
source: Monthly
es: Mensual
pt: Por Mês

# anual
source: Yearly
es: Anual
pt: Anual

source: Explore
es: Explorar
pt: Explorar

# tap1
source: Traducción múltiple
pt: Tradução múltipla

# tap2
source: Traducir texto de solicitud en varios idiomas
pt: Traduzir texto de solicitação em vários idiomas

# tap3
source: Crear Imagen
pt: Criar imagem

# tap4
source: Crea imágenes realistas a partir de una descripción en lenguaje natural
pt: Crie imagens realistas a partir de uma descrição em linguagem natural

# tap5
source: Grammar correction
es: Corrección de gramática
pt: Correção gramatical

# tap6
source: Corrects sentences With great precision
es: Corrige oraciones con gran precisión
pt: Corrige frases com grande precisão

# tap7
source: Create study notes
es: Crear notas de estudio
pt: Criar notas de estudo

# tap8
source: Provide a topic and get study notes.
es: Proporciona un tema y obtén notas de estudio.
pt: Forneça um tópico e obtenha notas de estudo.

# tap9
source: Tweet Creator
es: Creador de tuits
pt: Criador de tweets

# tap10
source: Create Some Ideas for Tweets with emojis 🤗
es: Crea algunas ideas para tuits con emojis 🤗
pt: Crie algumas ideias para tweets com emojis 🤗

# tap11
source: Ad from product description
es: Anuncio Producto
pt: Anúncio de produto

# tap12
source: Turn a product description into ad copy.
es: Convertir la descripción de un producto en texto publicitario.
pt: Transforme a descrição de um produto em uma cópia do anúncio.

# tap13
source: Interview questions
es: Preguntas de la entrevista
pt: Perguntas da entrevista

# tap14
source: Create interview questions.
es: Crear preguntas de entrevista
pt: Criar perguntas de entrevista.

# caracter
source: The model moves through tokens whereby 1 token is equivalent to 5 characters of response complexity of the model, the more tokens you have configured, the more complex and detailed will be the response given by the model, the less tokens you have configured, the shorter will be the response given.
es: El modelo se mueve a través de Tokens por la cual 1 Token equivalen a 5 Caracteres de respuesta de complejidad del modelo, cuando más tokens tenga configurado, más compleja y detallada será la respuesta dada por el modelo ,cuanto menos tokens tenga configurado más corta será la respuesta dada

# pr3
source: No tokens
es: Sin uso de Tokens
